Revit 2027 API
ExporterIFCUtils.ExportExtrudedSlabOpenings Method
Note: This API is now obsolete.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This function is deprecated in Revit 2027.  Use exportExtrudedSlabOpeningsAndReturnInfo instead.")]
public static void ExportExtrudedSlabOpenings(
	ExporterIFC exporterIFC,
	Element pElem,
	IFCLevelInfo levelInfo,
	IFCAnyHandle localPlacementAny,
	IList<IFCAnyHandle> elementSlabAnyArr,
	IList<IList<CurveLoop>> extrusionLoops,
	Plane plane,
	IFCProductWrapper pWrapper
)
<ObsoleteAttribute("This function is deprecated in Revit 2027.  Use exportExtrudedSlabOpeningsAndReturnInfo instead.")>
Public Shared Sub ExportExtrudedSlabOpenings (
	exporterIFC As ExporterIFC,
	pElem As Element,
	levelInfo As IFCLevelInfo,
	localPlacementAny As IFCAnyHandle,
	elementSlabAnyArr As IList(Of IFCAnyHandle),
	extrusionLoops As IList(Of IList(Of CurveLoop)),
	plane As Plane,
	pWrapper As IFCProductWrapper
)
public:
[ObsoleteAttribute(L"This function is deprecated in Revit 2027.  Use exportExtrudedSlabOpeningsAndReturnInfo instead.")]
static void ExportExtrudedSlabOpenings(
	ExporterIFC^ exporterIFC,
	Element^ pElem,
	IFCLevelInfo^ levelInfo,
	IFCAnyHandle^ localPlacementAny,
	IList<IFCAnyHandle^>^ elementSlabAnyArr,
	IList<IList<CurveLoop^>^>^ extrusionLoops,
	Plane^ plane,
	IFCProductWrapper^ pWrapper
)
[<ObsoleteAttribute("This function is deprecated in Revit 2027.  Use exportExtrudedSlabOpeningsAndReturnInfo instead.")>]
static member ExportExtrudedSlabOpenings :
        exporterIFC : ExporterIFC *
        pElem : Element *
        levelInfo : IFCLevelInfo *
        localPlacementAny : IFCAnyHandle *
        elementSlabAnyArr : IList<IFCAnyHandle> *
        extrusionLoops : IList<IList<CurveLoop>> *
        plane : Plane *
        pWrapper : IFCProductWrapper -> unit
Parameters
exporterIFC ExporterIFC
pElem Element
levelInfo IFCLevelInfo
localPlacementAny IFCAnyHandle
elementSlabAnyArr IList<IFCAnyHandle>
extrusionLoops IList<IList<CurveLoop>>
plane Plane
pWrapper IFCProductWrapper
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace